@startuml
[*] --> トップページ
トップページ -> アカウント情報: ログイン中登録情報クリック
アカウント情報:entry/ID,パスワード,氏名,住所,電話,アドレス
アカウント情報:do/登録
トップページ -left-> ログイン : ログインをクリック
ログイン:entry/id password
ログイン:do/ログイン
トップページ --> 商品検索 : 商品検索をクリック
商品検索-->商品詳細 : 商品をクリック
商品検索-->カート内 : カートに入れるをクリック
商品検索:entry/商品名、カテゴリ
商品検索:do/検索
トップページ:do/商品一覧をクリック
トップページ --> 中古商品追加 : 追加ボタンをクリック
中古商品追加:entry/文字情報
中古商品追加:upload/図情報
中古商品追加:do/アップロード
中古商品追加 --> トップページ : 商品アップロード完了
トップページ --> 商品詳細 : 商品をクリック
トップページ --> カート内 : カートの中をクリック
商品詳細 --> カート内 : カートに入れるをクリック
商品詳細 --> トップページ : 前の画面に戻るをクリック
商品詳細:view/商品情報
state カート内{
カート -> お届け先入力 : 注文をクリック
カート -left-> カート : 商品の変更削除クリック
お届け先入力 -> お届け先入力内容確認 : 入力内容確認をクリック
お届け先入力内容確認 -> お届け先入力 :届け先修正をクリック
お届け先入力内容確認 -> 購入完了 : 注文確定をクリック
}
@enduml
